Tekla Open API Reference for Tekla Structures 2025
Enum<E> Structure
The Enum datatype generic.
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[TypeConverterAttribute(typeof(EnumConverter))]
public struct Enum<E> : IXmlSerializable, IDataType
where E : struct, new()
<TypeConverterAttribute(GetType(EnumConverter))>
Public Structure Enum(Of E As {Structure, New})
	Implements IXmlSerializable, IDataType
Type Parameters
E
The enum to handle.
The Enum<E> type exposes the following members.
Properties
Name | Description
Value
Gets or sets the value.
Top
Methods
Name | Description
GetSchema
ReadXml
WriteXml
Top
See Also
Reference
Tekla.Structures.Datatype Namespace